app/views/users/_form.html.erb

SELECT "roles".* FROM "roles"
---
    <%= form.label :role_id, style: "display: block" %>
    <%= collection_select(
  :user, :role_id, Role.all, :id, :name, { prompt: true }
) %>