app/controllers/items_controller.rb

  def list
    items = Item.includes(:descrizione)
---
SELECT "items".* FROM "items"

  def create
#    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("tipo", "materiale", "diametro", "lunghezza", "larghezza", "spessore", "descrizione", "stato", "desc_stato", "created_by_user", "created_by_time", "deleted_by_user", "deleted_by_time", "img_path", "from_commessa", "from_disegno", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "diametro" = ?, "created_by_user" = ?, "deleted_by_user" = ?, "img_path" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["diametro", 51.0], ["created_by_user", ""], ["deleted_by_user", ""], ["img_path", ""], ["updated_at", "2024-03-20 07:29:08.199471"], ["id", 6]]

  def destroy
    @item.destroy!
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 2]]

  def tagged
    # Effettua il filtraggio dei dati in base ai parametri ricevuti dalla richiesta AJAX

    # RECAP STATO ELEMENTI
    # 0 = Ritirato / Scaduto
    # 1 = Valido
    # 2 = Prenotato

    @tagged_items = Item.where(stato: 2)
---
SELECT "items".* FROM "items" WHERE "items"."stato" = ?  [["stato", 2]]