app/controllers/items_controller.rb

  def index
    render 'index'
    @items = Item.all
---
SELECT "items".* FROM "items"