app/controllers/users_controller.rb

INSERT INTO "users" ("name", "role_id", "created_at", "updated_at", "username", "surname", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
 #   @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "role_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role_id", 3], ["updated_at", "2024-03-12 15:51:23.097799"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)