app/models/user.rb

  def assign_role
    self.role = Role.find_by name: 'Admin' if role.nil?
---
SELECT "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "Worker"], ["LIMIT", 1]]